CF/Documents/УстановкаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УстановкаЦен</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Documents/УстановкаЦен/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	
	Для каждого СтрокаТовары Из Товары Цикл
		НС = Движения.ЦеныНоменклатуры.Добавить();
		НС.Период = Дата;
		НС.Номенклатура = СтрокаТовары.Номенклатура;
		НС.Контрагент = Контрагент;
		НС.ЦенаПродажи = СтрокаТовары.ЦенаПродажи;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// проверим, может на этот день уже установлены цены
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатуры.Период КАК Период,
	               |	ЦеныНоменклатуры.ЦенаПродажи КАК ЦенаПродажи
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	               |ГДЕ
	               |	ЦеныНоменклатуры.Контрагент = &Контрагент
	               |	И ЦеныНоменклатуры.Период = &Период
	               |	И ЦеныНоменклатуры.Номенклатура В(&Номенклатура)
	               |	И ЦеныНоменклатуры.Регистратор <> &Регистратор";
	
	МассивНоменклатуры = Товары.ВыгрузитьКолонку("Номенклатура");
	Запрос.Параметры.Вставить("Контрагент",Контрагент);
	Запрос.Параметры.Вставить("Период",НачалоДня(Дата));
	Запрос.Параметры.Вставить("Номенклатура",МассивНоменклатуры);
	Запрос.Параметры.Вставить("Регистратор",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		// что-то установлено на дату документа.
		// составим текст сообщения пользователю
		ТекстСообщения = "";
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСтроки = "Для номенклатуры "+Выборка.Номенклатура+" уже установлена цена "+Выборка.ЦенаПродажи+" на дату "+Выборка.Период;
			Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС;
			КонецЕсли;
			ТекстСообщения = ТекстСообщения + ТекстСтроки;
		КонецЦикла;
		Сообщить(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
